{
  "title": "Function-based Styling",
  "date": "Dec 19 2016",
  "status": {
    "active": false,
    "title": "Writing",
    "color": "silver"
  },
  "description": "My transition from component-based to function-based styling and how it sparked an interest in design systems.",
  "link": {
    "title": "Read Article",
    "path": "/function-based-styling"
  },
  "meta": {
    "type": "article",
    "title": "Function-based Styling",
    "images": {
      "og": "/images/writing/function-based-css/meta-og.jpg",
      "twitter": "/images/writing/function-based-css/meta-twitter.jpg"
    }
  },
  "content": [
    {
      "content": [
        {
          "type": "text",
          "text": "When I started learning about front-end development my CSS files were a giant knot of overly specific classes that were impossible to manage. The bigger the stylesheet the bigger the knot. My stylesheets were such a tangled mess that making a change to an existing class created an unintentional ripple effect throughout my sites. As a consequence, to make a predictable change I had to create a new, more specific class. Which meant a bigger stylesheet. Which resulted in a bigger knot."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/writing/function-based-css/mess@1x.jpg",
            "2x": "/images/writing/function-based-css/mess@2x.jpg",
            "alt": "A tangled mess of a knot with different colors and squiggles. Yuck."
          }
        },
        {
          "type": "text",
          "text": "I was frustrated, so I started questioning and looking for solutions. How do the best developers and top product companies manage their stylesheets? I chatted with designer friends, inspected websites, read articles, and re-listened to several <a class=\"no-underline bb b--light-gray dark-gray dim\" href=\"https://spec.fm/podcasts/design-details\" target=\"_blank\">Design Details</a> episodes. A friend of mine shared <a class=\"no-underline bb b--light-gray dark-gray dim\" href=\"http://mrmrs.io/writing/2016/03/24/scalable-css/\" target=\"_blank\">CSS and Scalability</a>, an article written by <a class=\"no-underline bb b--light-gray dark-gray dim\" href=\"http://mrmrs.cc/\" target=\"_blank\">Adam Morse</a> that talks about the benefits of function-based styling and his experience managing stylesheets. After reading more of Adam’s thoughts on CSS and learning about his active involvement with the development community, I found <a class=\"no-underline bb b--light-gray dark-gray dim\" href=\"http://tachyons.io/\" target=\"_blank\">Tachyons</a>, one of his side projects, and decided to give it a try on my next client project."
        },
        {
          "type": "text",
          "text": "At first, function-based styling felt wrong because it required an opposite approach to component-based styling. Instead of building UI components by adding a single, multi-property class I was building components by adding multiple, single-property classes. My component-based mindset refused to share a button’s padding with the site’s navigation menu and it hated cluttering my markup with so many classes. It wasn’t until I completed the first webpage that I became aware of the power of function-based styling. I realized my markup was readable, my classes reusable, and changes were predictable. What was once a bloated knot of overly specific classes became a collection of lean, globally reusable properties."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/writing/function-based-css/yes@1x.jpg",
            "2x": "/images/writing/function-based-css/yes@2x.jpg",
            "alt": "A square block composed of small, repeating, color-coded shapes. It's lovely."
          }
        },
        {
          "type": "text",
          "text": "After working with Tachyons on my first client project, I started building websites faster and creating lean, manageable, and scaleable stylesheets. I quickly fell in love with the system mindset that is a result of prioritizing reusability. Instead of creating random, unrelated values for a component I started creating specific, scalable values for the entire website. Learning about function-based styling sparked an interest in learning more about design systems and their function in scaling digital products."
        }
      ]
    },
    {
      "title": "Favorite Sources",
      "content": [
        {
          "type": "list",
          "list": [
            {
              "title": "Lego Bits ft. Adam Morse",
              "subtitle": "Design Details Podcast",
              "link": "Hear Interview",
              "source": "https://spec.fm/podcasts/design-details/16190",
              "avatar": "/images/press/podcast.svg"
            },
            {
              "title": "Freedom Juice ft. Jon Gold",
              "subtitle": "Design Details Podcast",
              "link": "Hear Interview",
              "source": "https://spec.fm/podcasts/design-details/14150",
              "avatar": "/images/press/podcast.svg"
            },
            {
              "title": "Adam Morse on CSS",
              "subtitle": "CSSConf Oakland 2014",
              "link": "Watch Video",
              "source": "https://www.youtube.com/watch?v=14N_V56tqd4&t=627s",
              "avatar": "/images/sources/video.svg"
            },
            {
              "title": "CSS and Scalability",
              "subtitle": "by Adam Morse",
              "link": "Read Article",
              "source": "http://mrmrs.io/writing/2016/03/24/scalable-css/",
              "avatar": "/images/sources/article.svg"
            },
            {
              "title": "Functional Programing",
              "subtitle": "by Jon Gold",
              "link": "Read Article",
              "source": "http://www.jon.gold/2015/07/functional-css/",
              "avatar": "/images/sources/article.svg"
            }
          ]
        }
      ]
    }
  ]
}
