{
  "type": "Case Study",
  "name": "Materiales Vallejo",
  "category": "Website",
  "status": {
    "active": false,
    "title": "Draft",
    "color": "gold"
  },
  "caption": "A design overview of the store's first website and the business and user needs that guided the site's design",
  "card": {
    "title": "View Case Study",
    "1x": "/images/projects/materiales-vallejo/card@1x.jpg",
    "2x": "/images/projects/materiales-vallejo/card@2x.jpg",
    "alt": "Image pending."
  },
  "source": {
    "site": {
      "title": "Website",
      "path": "http://materialesvallejo.netlify.com/"
    },
    "code": {
      "title": "Source Code",
      "path": "https://github.com/claudiovallejo/materiales-vallejo"
    }
  },
  "tool_kit": {
    "title": "Tool Kit",
    "tools": [
      {
        "title": "Swipies",
        "subtitle": "Sketching",
        "link": "View Site",
        "color": "royal",
        "path": "http://swipi.es/",
        "profile": {
          "image": {
            "path": "/images/tools/swipies.svg",
            "alt": "Swipies concept icon"
          }
        }
      },
      {
        "title": "Figma",
        "subtitle": "Web Design",
        "link": "View Site",
        "color": "violet",
        "path": "https://www.figma.com/",
        "profile": {
          "image": {
            "path": "/images/tools/figma.svg",
            "alt": "Figma concept icon"
          }
        }
      },
      {
        "title": "Photoshop",
        "subtitle": "Image Editing",
        "link": "View Site",
        "color": "mint",
        "path": "http://www.adobe.com/products/photoshop.html",
        "profile": {
          "image": {
            "path": "/images/tools/photoshop.svg",
            "alt": "Photoshop concept icon"
          }
        }
      },
      {
        "title": "Middleman",
        "subtitle": "Static Site Generator",
        "link": "View Site",
        "color": "gold",
        "path": "https://middlemanapp.com/",
        "profile": {
          "image": {
            "path": "/images/tools/middleman.svg",
            "alt": "Middleman concept icon"
          }
        }
      },
      {
        "title": "Tachyons",
        "subtitle": "Reusable Styling",
        "link": "View Site",
        "color": "orange",
        "path": "http://tachyons.io/",
        "profile": {
          "image": {
            "path": "/images/tools/tachyons.svg",
            "alt": "Swipies concept icon"
          }
        }
      },
      {
        "title": "Gulp.js",
        "subtitle": "File Optimization",
        "link": "View Site",
        "color": "chili",
        "path": "http://gulpjs.com/",
        "profile": {
          "image": {
            "path": "/images/tools/gulp.svg",
            "alt": "Gulp concept icon"
          }
        }
      },
      {
        "title": "Netlify",
        "subtitle": "Continuous Deploys",
        "link": "View Site",
        "color": "jade",
        "path": "https://www.netlify.com/",
        "profile": {
          "image": {
            "path": "/images/tools/netlify.svg",
            "alt": "Netlify concept icon"
          }
        }
      }
    ]
  },
  "meta": {
    "type": "article",
    "title": "Materiales Vallejo Website Case Study",
    "images": {
      "og": "/images/projects/materiales-vallejo/meta-og.jpg",
      "twitter": "/images/projects/materiales-vallejo/meta-twitter.jpg"
    }
  },
  "content": [
    {
      "content": [
        {
          "type": "text",
          "text": "Materiales Vallejo is a small building material store in Matamoros, Mexico selling cement, steel rebars, and other building materials to local clients. The business needed a website to engage with new clients and to serve as a tool to expedite their hiring process."
        },
        {
          "type": "comment",
          "text": "Note: The <a class=\"no-underline bb b--light-gray gray dim\" href=\"https://www.materialesvallejo.com/\" target=\"_blank\">official business website</a> is in Spanish so I created a separate English site for reference."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/hero@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/hero@2x.jpg",
            "alt": "Materiales Vallejo Case Study: Designing and building a material store's first website."
          }
        }
      ]
    },
    {
      "title": "Business Details",
      "content": [
        {
          "type": "text",
          "text": "Materiales Vallejo’s revenue comes from sales to local material stores, hardware stores, construction firms and individuals. Most clients are long-term, loyal clients and have a close relationship with the business. Clients are used to negotiate product pricing and payment terms. As a consequence, phone and in-person interactions are preferred to facilitate negotiation. Clients call the business at least once a week to inquire about product availability and establish new orders."
        },
        {
          "type": "text",
          "text": "Materiales Vallejo uses manual processes for daily management tasks. It doesn’t count with an up-to-date inventory system and most of its sales transactions are made with cash. When there’s an available job, the business purchases newspaper and radio ads with a job description and application instructions. Interested applicants are asked to purchase a job application form at a local office supply store and deliver the application in person or email a scanned copy."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/business@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/business@2x.jpg",
            "alt": "A stack of business images. The top-most image depicts one of the business's employees smiling, rolling a wheel barrow.",
            "caption": "An employee is checking the client's invoice to load the purchased material"
          }
        }
      ]
    },
    {
      "title": "User Details",
      "content": [
        {
          "type": "text",
          "text": "The core user profile is based on Materiales Vallejo’s client profile. Most clients are familiar with building material use and terminology and prefer to engage with the business on the phone. Core users are construction firm secretaries and small business owners hunting for the cheapest prices across town. Core users will need to know about the business, what it offers, and how to get in touch with the business."
        },
        {
          "type": "text",
          "text": "Secondary users are potential job applicants that will find out about the available job through a newspaper or radio ad. Instead of sending applicants to purchase an application form, the ad will provide a link to the job detail page where potential new hires will find out more about the job and fill out and submit an application form."
        }
      ]
    },
    {
      "title": "Website Details",
      "content": [
        {
          "type": "text",
          "text": "The website was designed to provide a fast but complete run through of the business. The site has a landing page, about page, and dynamic careers pages. The landing page was designed primarily for core users, and provides all the information they need for a quick experience. The landing page was designed for fast consumption to minimize search time and maximize the probability of turning the visit into an engagement."
        },
        {
          "type": "text",
          "text": "The navigation menu is fixed and has a contact button that displays the available form of contact at the time of visit. If the store is open, the button invites users to call the store. If the business is out for lunch or closed, the button invites users to send an email."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/nav-detail@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/nav-detail@2x.jpg",
            "alt": "Dynamic desktop navigation menus and dynamic mobile contact buttons.",
            "caption": "Dynamic desktop and mobile contact buttons."
          }
        },
        {
          "type": "text",
          "text": "The landing page's hero section has a dark background to focus the user's attention on the section's content, which briefly describes who the business is and what it does. The section has two buttons that link to the product and service sections to provide fast links to important sections of the page."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/hero-detail@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/hero-detail@2x.jpg",
            "alt": "Desktop hero section",
            "caption": "Desktop hero section"
          }
        },
        {
          "type": "text",
          "text": "A carousel was designed to provide a quick way of navigating through the available products. Products were grouped by category for fast product navigation and categories were ordered by popularity. On desktops, users can navigate the carousel with the navigation arrows. On mobiles and tablets, users can scroll through the carousel to navigate through the available products."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/carousel-detail-desktop@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/carousel-detail-desktop@2x.jpg",
            "alt": "Desktop product carousel with navigation arrows",
            "caption": "Desktop product carousel with navigation arrows"
          }
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/carousel-detail-tablet@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/carousel-detail-tablet@2x.jpg",
            "alt": "Scrollable tablet product carousel",
            "caption": "Scrollable tablet product carousel"
          }
        },
        {
          "type": "text",
          "text": "Product cards were designed to inform users about product availability. Tapping the card displays details about sale unit and available measurements."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/card-detail@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/card-detail@2x.jpg",
            "alt": "Default and active product card states",
            "caption": "Default and active product card states"
          }
        },
        {
          "type": "text",
          "text": "The contact section displays dynamic content that updates based on the store’s current status. If the business is open, the section’s description invites users to call the business and the store number is highlighted and calls the store. If the business is out for lunch or closed, the section’s description informs the user of the store’s status and the email is highlighted and opens the user’s email client."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/contact-detail@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/contact-detail@2x.jpg",
            "alt": "Mobile contact sections—open out for lunch, and closed states",
            "caption": "Mobile contact sections: open, out for lunch, and closed states"
          }
        },
        {
          "type": "text",
          "text": "When there’s an available job the index and about pages display a job banner above the footer to avoid interrupting the core user’s experience. A careers page is dynamically created and lists the available jobs. Each job has a job detail page that displays a brief job description and links to a job application form. Job application forms are designed based on the standard Mexican job application forms."
        },
        {
          "type": "media",
          "media": {
            "1x": "/images/projects/materiales-vallejo/job-detail@1x.jpg",
            "2x": "/images/projects/materiales-vallejo/job-detail@2x.jpg",
            "alt": "Mobile job banner, job detail, and application form",
            "caption": "Mobile job banner, job detail, and application form"
          }
        }
      ]
    },
    {
      "title": "Next Steps",
      "content": [
        {
          "type": "text",
          "text": "Materiales Vallejo’s website was published on December 2016 and is tracking user data to learn more about the user's context. Despite the business not being interested in investing more time on the website, I'll be monitoring the site's activity and check for cross-browser compatible bugs and other issues."
        },
        {
          "type": "text",
          "text": "Through this project I got a chance to learn more about the way the business operates and handles daily tasks. While Materiales Vallejo's transactions are still cash-based and online shopping is years away, there are other areas where software business tools could expedite daily tasks and improve communication with clients. I've talked with my client about designing a business tool to help them in daily operations, and may pursue the opportunity if it opens up."
        }
      ]
    },
    {
      "title": "Insights",
      "content": [
        {
          "type": "text",
          "text": "The project was a great opportunity to work on the full design and development process. When the project started I had prior experience with website builders and a limited understanding of HTML, CSS, and JavaScript. Throughout the project I faced multiple challenges and made innumerable mistakes on a number of different areas—communication, process, time management, design, and development. Through these challenges and mistakes I became aware of several business and design principles—"
        },
        {
          "type": "block",
          "block": [
            {
              "title": "Building Tools",
              "description": "The value of a business website comes from solving real business problems. Business web design is about building usable tools, not useless trophies."
            },
            {
              "title": "External Factors",
              "description": "The ideal design solution may not be the right solution due to long-time business habits, technical limitations, and personal and cultural factors."
            },
            {
              "title": "Iteration",
              "description": "Product design is not a one-time thing. It's a continuous, long-term process composed of many small improvements and updates based on user and business needs."
            }
          ]
        }
      ]
    }
  ]
}
